export const MISSION = [
  {
    icon: '/about/leaf.svg',
    desc: 'Ми прагнемо до високого стандарту якості в реалізації наших проектів, спрямованих на забезпечення сталого розвитку та збалансованого використання природних ресурсів. Наша діяльність орієнтована на створення інноваційних рішень, які не лише сприяють ефективному використанню енергії, але й зменшують негативний вплив на навколишнє середовище.'
  },
  {
    icon: '/about/leaf.svg',
    desc: `Ми віримо, що об'єднання сил індивідів, компаній, та організацій з різних галузей може призвести до створення інтегрованих та революційних рішень для проблем екології та енергетики. Зацікавлені сторони мають унікальну можливість співпраці та обміну ідеями, спрямованими на покращення стану нашого оточення.`
  },
  {
    icon: '/about/leaf.svg',
    desc: `Наша місія є невід'ємною частиною формування свідомого громадянського суспільства, де кожен може внести свій внесок у створення сталого та здорового майбутнього. Запрошуємо всіх, хто поділяє нашу віру у можливості позитивних змін, приєднатися до нашої спільноти та внести свою частинку у велику мозаїку екологічного та енергетичного розвитку.` 
  },
];