export const GOALS = [
  {
    title: 'Сталий розвиток через інновації, стандартизацію та інфраструктурний прогрес',
    desc: `Ми прагнемо до створення й впровадження передових технологій, які будуть енергоефективними екологічно безпечними та відповідати міжнародним стандартам. Цільовою нашою діяльністю є створення  інклюзивної інфраструктури, яка забезпечить стійке та відповідальне індустріальне зростання, сприяючи при цьому загальному благополуччю суспільства. Ми прагнемо заохочувати та підтримувати стартапи, спрямовані на розв'язання екологічних завдань.`,
  },
  {
    title: 'Просвітницька робота',
    desc: `Розповсюдження корисної інформації та навчання громадян екологічно відповідальному способу життя є важливим етапом у збереженні навколишнього середовища. Шляхом освіти та інформування громадян про екологічні проблеми та можливі шляхи їх вирішення, можна активізувати зусилля населення у збереженні природи. Це сприяє створенню національної та глобальної свідомості щодо потреби в бережливому ставленні до природних ресурсів.`,
  },
  {
    title: 'Партнерство, підтримка  та допомога',
    desc: `Активізація глобального партнерства для досягнення сталого розвитку, захист екологічних, соціальних та економічних інтересів суспільства, забезпечення допомоги регіонам, що постраждали від екологічних, енергетичних катастроф та конфліктів, для відновлення стабільності та збереження природних ресурсів.`, 
  },
  {
    title: 'Активна та спільна робота щодо поліпшення екологічної ситуації',
    desc: `Об'єднання зусилль в боротьбі зі змінами клімату, збереженні біорізноманіття та поліпшенні екологічної ситуації в країні, активно взаємодіючи з науковими установами, урядовими та громадськими організаціями.`
  },
]


// старий дизайн
//---------------------------------------
// export const GOALS = [
//   {
//     number: '/about/img-1.png',
//     icon: '/about/leaf.svg',
//     title: 'Сталий розвиток через інновації, стандартизацію та інфраструктурний прогрес',
//     desc: `Ми прагнемо до створення й впровадження передових технологій, які будуть енергоефективними екологічно безпечними та відповідати міжнародним стандартам. Цільовою нашою діяльністю є створення  інклюзивної інфраструктури, яка забезпечить стійке та відповідальне індустріальне зростання, сприяючи при цьому загальному благополуччю суспільства. Ми прагнемо заохочувати та підтримувати стартапи, спрямовані на розв'язання екологічних завдань.`
//   },
//   {
//     number: '/about/img-2.png',
//     icon: '/about/leaf.svg',
//     title: 'Просвітницька робота',
//     desc: `Розповсюдження корисної інформації та навчання громадян екологічно відповідальному способу життя є важливим етапом у збереженні навколишнього середовища. Шляхом освіти та інформування громадян про екологічні проблеми та можливі шляхи їх вирішення, можна активізувати зусилля населення у збереженні природи. Це сприяє створенню національної та глобальної свідомості щодо потреби в бережливому ставленні до природних ресурсів.`
//   },
//   {
//     number: '/about/img-3.png',
//     icon: '/about/leaf.svg',
//     title: 'Партнерство, підтримка  та допомога',
//     desc: `Активізація глобального партнерства для досягнення сталого розвитку, захист екологічних, соціальних та економічних інтересів суспільства, забезпечення допомоги регіонам, що постраждали від екологічних, енергетичних катастроф та конфліктів, для відновлення стабільності та збереження природних ресурсів.`
//   },
//   {
//     number: '/about/img-4.png',
//     icon: '/about/leaf.svg',
//     title: 'Активна та спільна робота щодо поліпшення екологічної ситуації',
//     desc: `Об'єднання зусилль в боротьбі зі змінами клімату, збереженні біорізноманіття та поліпшенні екологічної ситуації в країні, активно взаємодіючи з науковими установами, урядовими та громадськими організаціями.`
//   },
// ]