export const PRINCIPLES = [
  {
    icon: '/about/checkmark.svg',
    title: 'професіоналізм',
    desc: ` Постійне вдосконалення професійних навичок та знань у відповідності до сучасних стандартів.`
  },
  {
    icon: '/about/checkmark.svg',
    title: 'новаторство',
    desc: `Постійне вдосконалення професійних навичок та знань у відповідності до сучасних стандартів.`
  },
  {
    icon: '/about/checkmark.svg',
    title: 'відповідальність',
    desc: `Турбота про наслідки власних дій на рівні громадської та екологічної відповідальності.`
  },
  {
    icon: '/about/checkmark.svg',
    title: 'об’єктивність',
    desc: `Забезпечення нейтрального та об’єктивного підходу в усіх справах та прийнятті рішень.`
  },
  {
    icon: '/about/checkmark.svg',
    title: 'екосвідомість',
    desc: `Викладаємо принципи поваги до природи та прагнемо сформувати екологічну свідомість, організовуючи заходи та проекти.`
  },
  {
    icon: '/about/checkmark.svg',
    title: 'незалежність',
    desc: `Забезпечення незалежності в прийнятті рішень від зовнішніх впливів чи інтересів.`
  },
  {
    icon: '/about/checkmark.svg',
    title: 'прозорість',
    desc: `Забезпечення відкритості та доступності інформації для всіх зацікавлених сторін.`
  },
  {
    icon: '/about/checkmark.svg',
    title: 'сталий розвиток',
    desc: `Зобов’язання до постійного розвитку та адаптації до нових викликів.`
  },
]