import Image from "next/image";

const Hero = () => {
  return (
    <>
      <section className="hero">
        <div className="hero__container">
          <div className="hero__img">
            <div className="hero__title-container">
              <div className="visually-hidden">
                <h1 className="hero__title">
                  Платформа еко-енергетичних ініціатив
                </h1>
                <div className="line " />
              </div>
              <h2 className="hero__text">Екологічна безпека</h2>
              <h2 className="hero__text">Енергетична незалежність</h2>
            </div>
          </div>
        </div>

        <div className="container">
          <div
            style={{
              display: "flex",
              flexDirection: "column",
              alignItems: "center",
              padding: "10px",
            }}
          >
            <Image
              className="hero__img-first"
              src="/environmental-nonprofit.jpg"
              alt="вітряки"
              width={480}
              height={300}
            />
            <Image
              className="hero__img-second"
              src="/environmental-nonprofit-34.jpg"
              alt="листя"
              width={480}
              height={300}
            />
          </div>

          <div>
            <p className="hero__text-second">
              Громадська Організація “Платформа еко-енергетичних ініціатив”
              об’єднує експертів фахівців, та активістів навколо просування
              ідеї:
            </p>
            <ul className="hero__list">
              <li className="hero__item">
                <p className="hero__text-second">
                  збереження довкілля що є критично важливим завданням у
                  сучасному світі. Це включає в себе заходи щодо збереження
                  природних ресурсів, зменшення викидів та забруднення, охорони
                  біорізноманіття та створення сталого способу життя. Для
                  досягнення цієї мети необхідні комплексні заходи на рівні
                  країни та глобальному рівні, інновацій в технології переробки
                  вторинної сировини, що грає важливу роль у зменшенні відходів
                  та збереженні ресурсів, зменшення використання одноразових
                  матеріалів, впровадження більш ефективних технологій та
                  стимулювання сталого споживання. Збереження довкілля є
                  ключовим завданням для забезпечення життєздатності нашої
                  планети для майбутніх поколінь.
                </p>
              </li>
              <li className="hero__item">
                <p className="hero__text-second">
                  Переробка вторинної сировини; Сучасні технології дозволяють
                  ефективно використовувати вторинну сировину для виробництва
                  нових продуктів, що сприяє зменшенню негативного впливу на
                  навколишнє середовище.
                </p>
              </li>
              <li className="hero__item">
                <p className="hero__text-second">
                  Впровадження інновацій в сфері відновлювальної енергетики що
                  відіграє важливу роль у зменшенні залежності від традиційних
                  джерел енергії та зниженні викидів парникових газів. Це
                  охоплює розвиток та використання новітніх технологій для
                  виробництва електроенергії з відновлюваних джерел, таких як
                  сонячна, вітрова, гідроенергетика та біомаса. Впровадження
                  інновацій у цій сфері допомагає покращити ефективність та
                  надійність виробництва відновлювальної енергії, знизити вплив
                  на довкілля та сприяти сталому розвитку. Дотримання
                  міжнародних стандартів сталого розвитку у галузі енергетики є
                  ключовим для забезпечення екологічно чистого та сталого
                  енергетичного майбутнього.
                </p>
              </li>
            </ul>
          </div>
        </div>
      </section>
    </>
  );
};

export default Hero;
