export const ABOUT_US = [
  {
    icon: '/about/leaf.svg',
    desc: 'Організація активно працює над вдосконаленням технологій переробки вторинної сировини, залучаючи до цієї справи фахівців і бізнесменів, молодь і громадськість.'
  },
  {
    icon: '/about/leaf.svg',
    desc: 'Розробляє та впроваджує програми переробки вторинної сировини, щоб зменшити забруднення зовнішнього середовища та сприяти ефективному використанню ресурсів. Відходи стають вихідним матеріалом для нових, сталих виробів, допомагаючи зберегти наше довкілля.'
  },
  {
    icon: '/about/leaf.svg',
    desc: 'Проводить інтерактивні роз’яснювальні заняття серед підлітків.'
  },
];