{
  "supportUs": "Підтримати нас",
  "confirm": "Підтвердити",
  "donate": "Зробити внесок",
  "donateСlosed": "Збір закрито",

  "environmentalSecurityEnergyIndependence": "Екологічна безпека - енергетична незалежність",
  "environmental": "Екологічна",
  "security": " безпека",
  "energy": "енергетична",
  "independence": " незалежність",
  "charityEventsPageFirst": "Нащі ",
  "charityEventsPageSecond": "проекти",
  "wePromoteSuchIdeas": "Просуваємо такі ",
  "wePromoteSuchIdeasAccent": "ідеї:",
  "preservingTheEnvironment": "Збереження довкілля",
  "preservingTheEnvironmentDesc": "є ключовим завданням сучасності. Це включає зменшення викидів та забруднення, охорону біорізноманіття та створення сталого способу життя. Для досягнення цієї мети необхідні комплексні заходи на рівні країни та глобально, інновації в переробці вторинної сировини та підтримка сталого споживання.",
  "implementationOfInnovationsInTheFieldOfRenewableEnergy": "Впровадження інновацій в сфері відновлювальної енергетики ",
  "implementationOfInnovationsInTheFieldOfRenewableEnergyDesc": "відіграє важливу роль у зменшенні залежності зменшенні залежності від традиційних джерел енергії та впливу на довкілля. Використання передових технологій допомагає підвищити ефективність та надійність виробництва енергії з відновлюваних джерел, сприяючи сталому розвитку та дотриманню екологічних стандартів.",
  "recyclingOfSecondaryRawMaterials": "Переробка вторинної сировини",
  "recyclingOfSecondaryRawMaterialsDesc": "Сучасні технології дозволяють ефективно використовувати вторинну сировину для виробництва нових продуктів, що сприяє зменшенню негативного впливу на навколишнє середовище.",

  "charityActionsFirst": "Наші ",
  "charityActionsSecond": "проекти",
  "helpRaiseFunds": "Відкритий збір коштів на наші ",
  "helpRaiseFundsAccent": "проекти",
  "collected": "Зібрано",
  "totalAmount": "Наша ціль",
  "allProjects": "Усі проєкти",
  "projects": "Проєкт ",
  "aboutTheProject": "Про проєкт",
  "projectReporting": "Звітність по проєкту",
  "projectReport": "Звіт по проєкту",

  "photoReport": "фото",
  "backToProjects": "Назад до проєктів",

  "reviews": "Відгуки",
  "leaveAReview": "Залишити відгук",

  "News": "новини",

  "allNews": "Усі новини",

  "theWebsiteDevelopmentTeam": "Команда розробки сайту",
  "allRightsReserved": " Всі права захищено",

  "about": "Про",
  "us": " нас",

  "contactUs": "зв’яжіться з ",
  "contactUsSecond": "нами",
  "writeToUs": "Напишіть ",
  "writeToUsSecond": "нам",
  "fullName": "Прізвище та ім’я",
  "email": "Електронна пошта",
  "message": "Повідомлення",
  "messageErrorName": "Вкажіть ім’я",
  "messageSuccessName": "Ім'я введено правильно!",
  "messageErrorNameInvalid": "Ім'я повинно містити тільки букви",
  "messageErrorNameTooShort": "Кількість введених букв має бути більше 2",
  "messageErrorNameTooLong": "Кількість введених букв має бути не більше 60",
  "messageErrorEmail": "Вкажіть електронну адресу",
  "messageSuccessEmail": "Email введено правильно!",
  "emailAddressFormatIsIncorrect": "Невірний формат електронної адреси",
  "messageErrorEmaileTooShort": "Кількість введених символів має бути більше 9",
  "messageErrorEmailTooLong": "Кількість введених символів має бути не більше 128",
  "messageErrorMessageTooShort": "Довжина повідомлення не менша 7 символів",
  "messageErrorMessageTooLong": "Довжина повідомлення не більша 500 символів",
  "messagePlaceholder": "Будь ласка, напишіть сюди своє повідомлення",
  "messageSuccessMessage": "Повідомлення введено правильно!",
  "successMessage": "Повідомлення успішно надіслано!",
  "warningMessage": "Сталася помилка, спробуйте ще раз!",
  "send": "Надіслати",

  "PlatformForInitiatives": "\"Платформа еко-енергетичних ініціатив\"",
  "aboutUsPrimaryText": "об'єднує зусилля активістів для сприяння сталому та екологічно безпечному майбутньому. За допомогою інноваційних технологій та співпраці з експертами у сфері відновлення ресурсів, ми прагнемо до зменшення негативного впливу відходів на наше середовище.",
  "aboutUsOrganization": "Організація активно працює над вдосконаленням технологій переробки вторинної сировини, залучаючи до цієї справи фахівців і бізнесменів, молодь і громадськість.",
  "aboutUsDevelops": "Розробляє та впроваджує програми переробки вторинної сировини, щоб зменшити забруднення зовнішнього середовища та сприяти ефективному використанню ресурсів. Відходи стають вихідним матеріалом для нових, сталих виробів, допомагаючи зберегти наше довкілля.",
  "aboutUsExplanatoryClasses": "Проводить інтерактивні роз’яснювальні заняття серед підлітків.",
  "mission": "Місія",
  "organizations": "організації",
  "missionPrimaryText": "Створення простору інноваційної активності в сфері екології та енергетики з метою формування країни свідомих громадян. Ми розглядаємо себе як каталізатора позитивних змін, що об'єднує усіх зацікавлених сторін для реалізації проектів розвитку територіальних громад та секторів національної економіки, а також підтримки інноваційних ідей у сфер іекології та енергетики.",
  "missionHighStandardOfQuality": "Ми прагнемо до високого стандарту якості в реалізації наших проектів, спрямованихна забезпечення сталого розвитку та збалансованого використання природних ресурсів.Наша діяльність орієнтована на створення інноваційних рішень, які не лише сприяють ефективному використанню енергії, але й зменшують негативний вплив нанавколишнє середовище.",
  "missionPowerOfIndividuals": "Ми віримо, що об'єднання сил індивідів, компаній, та організацій з різних галузей може призвести до створення інтегрованих та революційних рішень для проблем екології таенергетики. Зацікавлені сторони мають унікальну можливість співпраці та обміну ідеями,спрямованими на покращення стану нашого оточення.",
  "missionConsciousCivilSociety": "Наша місія є невід'ємною частиною формування свідомого громадянського суспільства, де кожен може внести свій внесок у створення сталого та здорового майбутнього. Запрошуємо всіх, хто поділяє нашу віру у можливості позитивних змін, приєднатися до нашої спільнотита внести свою частинку у велику мозаїку екологічного та енергетичного розвитку.",
  "ours": "Наші",
  "values": "Цінності",
  "openness": "Відкритість",
  "trust": "Довіра",
  "efficiency": "Ефективність",
  "cooperation": "Співпраця",
  "goals": "Цілі",
  "titleGoalsSustainableDevelopment": "Сталий розвиток через інновації, стандартизацію та інфраструктурний прогрес",
  "textGoalsSustainableDevelopment": "Ми прагнемо до створення й впровадження передових технологій, які будуть енергоефективними екологічно безпечними та відповідати міжнародним стандартам. Цільовою нашою діяльністю є створення  інклюзивної інфраструктури, яка забезпечить стійке та відповідальне індустріальне зростання, сприяючи при цьому загальному благополуччю суспільства. Ми прагнемо заохочувати та підтримувати стартапи, спрямовані на розв'язання екологічних завдань.",
  "titleEducationalWork": "Просвітницька робота",
  "textEducationalWork": "Розповсюдження корисної інформації та навчання громадян екологічно відповідальному способу життя є важливим етапом у збереженні навколишнього середовища. Шляхом освіти та інформування громадян про екологічні проблеми та можливі шляхи їх вирішення, можна активізувати зусилля населення у збереженні природи. Це сприяє створенню національної та глобальної свідомості щодо потреби в бережливому ставленні до природних ресурсів.",
  "titlePartnership": "Партнерство, підтримка  та допомога",
  "textPartnership": "Активізація глобального партнерства для досягнення сталого розвитку, захист екологічних, соціальних та економічних інтересів суспільства, забезпечення допомоги регіонам, що постраждали від екологічних, енергетичних катастроф та конфліктів, для відновлення стабільності та збереження природних ресурсів.",
  "titleImproveTheEnvironmentalSituation": "Активна та спільна робота щодо поліпшення екологічної ситуації",
  "textImproveTheEnvironmentalSituation": "Об'єднання зусилль в боротьбі зі змінами клімату, збереженні біорізноманіття та поліпшенні екологічної ситуації в країні, активно взаємодіючи з науковими установами, урядовими та громадськими організаціями.",
  "principles": "принципи",
  "titleProfessionalism": "професіоналізм",
  "textProfessionalism": "Постійне вдосконалення професійних навичок та знань у відповідності до сучасних стандартів.",
  "titleInnovation": "новаторство",
  "textInnovation": "Активне впровадження інноваційних ідей та технологій у роботу.",
  "titleResponsibility": "відповідальність",
  "textResponsibility": "Турбота про наслідки власних дій на рівні громадської та екологічної відповідальності.",
  "titleObjectivity": "об’єктивність",
  "textObjectivity": "Забезпечення нейтрального та об’єктивного підходу в усіх справах та прийнятті рішень.",
  "titleEcoConsciousness": "екосвідомість",
  "textEcoConsciousness": "Викладаємо принципи поваги до природи та прагнемо сформувати екологічну свідомість, організовуючи заходи та проекти.",
  "titleIndependence": "незалежність",
  "textIndependence": "Забезпечення незалежності в прийнятті рішень від зовнішніх впливів чи інтересів.",
  "titleTransparency": "прозорість",
  "textTransparency": "Забезпечення відкритості та доступності інформації для всіх зацікавлених сторін.",
  "titleSustainableDevelopment": "сталий розвиток",
  "textSustainableDevelopment": "Зобов’язання до постійного розвитку та адаптації до нових викликів.",
  "buttonShowMore": "Показати більше",
  "buttonHide": "Приховати",
  "buttonAllProjects": "Усі проєкти",

  "work": "Робота",
  "withChildren": " з дітьми",

  "ourCommitment": "Наша зобов'язаність",
  "ourCommitmentDesc": "Ми взяли на себе зобов'язання не лише передавати знання, але й надихати дітей та молодь на активну діяльність для збереження нашої природи. Розуміючи невід'ємний вплив людської діяльності на екосистему, ми ведемо роботу, спрямовану на створення збалансованого та екологічно стійкого світу.",
  "environmentalEducationItAllStartsWithKnowledge": "Екологічна освіта: усе починається зі знань",
  "environmentalEducationItAllStartsWithKnowledgeDesc": "Наші програми екологічної освіти для дітей та молоді не лише передають базові знання про збереження природи, але й спонукають до дії. Ми розвиваємо в молоді вміння розуміти екосистеми, раціонально використовувати ресурси та створювати інноваційні рішення для зменшення впливу на довкілля.",
  "greenInitiativesOfYoungPeople": "Зелені ініціативи молоді",
  "greenInitiativesOfYoungPeopleDesc": "Ми віримо в силу ідеї та прагнемо надати підтримку молоді в реалізації їхніх зелених проектів. Через наші програми та ресурси, ми допомагаємо молоді створювати та впроваджувати інноваційні екологічні ідеї, що сприяють сталому розвитку.",
  "anInvitationToChange": "Запрошення до змін",
  "anInvitationToChangeDesc": "Ми закликаємо дітей та молодь бути агентами змін. Наша організація - це не лише платформа для отримання знань, але й спільнота ентузіастів, які прагнуть перетворити свої ідеї в реальність. Приєднуйтесь до нас, щоб разом ми могли втілити в життя екологічні цінності та стати партнерами у створенні зеленого та стійкого світу для нашого покоління та майбутніх.",
  "forPreservationForTheFuture": "За збереження, за майбутнє",
  "forPreservationForTheFutureDesc": "Ми віримо, що наша робота з дітьми та молоддю формує не лише екологічно свідому генерацію, але й відкриває двері до майбутнього, де кожен крок є екологічно відповідальним. Давайте разом зберігати природу для тих, хто буде досліджувати її завтра!",

  "protection": "охорона",
  "surroundings": " довкілля",
  "issues": "Проблематика",
  "issuesDesc": "Наша організація приділяє особливу увагу питанню охорони довкілля, розуміючи важливість нашого внеску в збереження навколишнього середовища. Ми розглядаємо проблему екології як необхідний аспект нашої діяльності та визнаємо, що маємо безпосередню відповідальність за стан навколишнього середовища.",
  "innovationAsOneOfTheVectors": "Інновації як один з векторів",
  "innovationAsOneOfTheVectorsDesc": "У наших ініціативах головними компонентами є використання інноваційних технологій та досягнення енергоефективності. Ми підтримуємо  впровадження нових технологій, спрямованих на зменшення викидів, оптимізацію енергоспоживання та підвищення ефективності використання відновлювальних джерел енергії.",
  "recyclingOfPlasticWaste": "Переробка пластикових відходів",
  "recyclingOfPlasticWasteDesc": "Ми активно працюємо над підтримкою переробки пластикових відходів, використовуючи передові технології та процеси для перетворення їх у вторинні матеріали та корисні предмети, сприяючи тим самим зменшенню кількості сміття та уникненню його негативного впливу на природу",
  "commitmentToSustainableDevelopment": "Відданість сталому розвитку",
  "commitmentToSustainableDevelopmentDesc": "Наша громадська організація віддана сталому розвитку та охороні довкілля. Ми враховуємо міжнародні стандарти щодо охорони довкілля та прагнемо перевершувати їх, створюючи збалансований підхід до розв'язання екологічних проблем. Наша мета - відновлення та підтримка екосистем, а також активна робота зі зменшення відходів та заохочення використання вторинної сировини як ключового елементу в цьому процесі, з метою забезпечення сталого розвитку та збереження природних ресурсів для майбутніх поколінь.",

  "withYoungPeople": " з молоддю",
  "hello": "Привіт!",
  "joinTheTeamDescFirst": "Шукаєш можливість приєднатися до групи людей, які дійсно прагнуть змінити світ на краще?",
  "joinTheTeamDescSecond": "Громадська організація «Платформа еко-енергетичних ініціатив» шукає саме тебе!",
  "joinTheTeamDescThird": "Ми об'єднуємо експертів, фахівців та активістів, які прагнуть зробити світ більш сталим та екологічно безпечним місцем для життя.",
  "joinTheTeam": "Долучитися до команди",
  "whatWeOffer": "Ми пропонуємо об'єднати зусилля для реалізації таких ініціатив:",
  "whatWeOfferFirstTitle": "Спільні проєкти",
  "whatWeOfferFirst": "Розробка та впровадження програм у сфері відновлюваної енергетики, енергоефективності та екологічної освіти.",
  "whatWeOfferSecondTitle": "Організація заходів",
  "whatWeOfferSecond": "Проведення спільних семінарів, тренінгів, конференцій та воркшопів для обміну знаннями та досвідом.",
  "whatWeOfferThirdTitle": "Обмін ресурсами",
  "whatWeOfferThird": "Взаємний обмін інформацією, матеріалами та іншими ресурсами для підвищення ефективності нашої діяльності.",
  "contactUsStepTitle": "Переваги партнерства дають такі можливості:",
  "contactUsStepFirst": "Розширення мережі контактів та партнерів у сфері екології та енергетики.",
  "contactUsStepSecond": "Отримання доступу до новітніх знань та технологій.",
  "contactUsStepThird": "Посилення впливу на розвиток екологічних та енергетичних ініціатив.",
  "contactUsDesc": "Якщо у вас є будь-які питання або ви хочете долучитися, будь ласка, зв'яжіться з нами для отримання додаткової інформації",
  "contactUsBtn": "Зв’язатися з нами",
  "stepsTitle": "Для приєднання до нашої команди тобі залишилось декілька кроків:",
  "steps": "Кроки",
  "stepsDescFirstBefore": "Ознайомитись зі ",
  "stepsDescFirstLink": "Статутом Громадської організації «Платформа еко-енергетичних ініціатив»",
  "stepsDescSecondBefore": "Заповнити заяву, що буде розглянута на засіданні Правління Громадської організації «Платформа еко-енергетичних ініціатив»",

  "stepsDescThirdBefore": "Надати згоду на обробку особистої інформації",

  "stepsDescFourthBefore": "Заповнити ",
  "stepsDescFourthLink": "анкету",
  "stepsDescFifth": "Пройти співбесіду",

  "partnering": "партнерство",
  "partners": "Партнери!",
  "partnersDescFirst": "Ми, ГО «Платформа еко енергетичних ініціатив», запрошуємо вас приєднатися до нашої місії сталого розвитку та збереження довкілля.",
  "partnersDescSecond": "Ваше партнерство - це можливість разом створити справжню зміну у світі.",
  "howYouCanSupport": "як ви можете підтримати",
  "supportInTransport": "Підтримка в транспортуванні",
  "supportInTransportDesc": "Ви матимете можливість внести свій вклад щодо транспортування матеріалів, обладнання, вторинної сировини для переробки та виробництва нових корисних речей.",
  "expertSupport": "Експертна підтримка",
  "expertSupportDesc": "Ви фахівець?  Ваша компетентність в еко енергетичних сферах буде надзвичайно важливою для організації та проведення семінарів, лекцій та інших освітніх заходів для громади, молоді, підлітків.",
  "resourceExchange": "Обмін ресурсами",
  "resourceExchangeDesc": "Ми віримо в силу обміну ідеями, ресурсами та досвідом,  у цей значний внесок у реалізацію наших ініціатив: еко-енергетичних, у сфері переробки та утилізації.",
  "benefitsOfPartnership": "Переваги партнерства",
  "deepImpact": "Глибокий вплив.",
  "deepImpactContinued": " Разом ми можемо робити більше, спільно реалізовуючи проекти та ініціативи для збереження навколишнього середовища",
  "exchangeOfExperience": "Обмін досвідом.",
  "exchangeOfExperienceContinued": " Партнерство відкриває можливість для обміну кращими практиками та інноваціями в сфері сталого розвитку",
  "raisingReputation": "Підняття репутації.",
  "raisingReputationContinued": " Ми прагнемо стати лідерами у важливих еко-енергетичних проектах, ініціативах щодо переробки вторинної сировини та зменшення відходів. Ми віримо, що наша активна участь у навчанні та просуванні ідеї роздільного збирання відходів як способу життя піднесе нашу репутацію та сприятиме нашим цілям сталого розвитку",
  "memorandumFirst": "Ми віримо у силу спільної дії та відкриті для всіх, хто хоче приєднатися до нашого руху. Разом ми можемо змінити світ, роблячи його чистішим та екологічно стійким для майбутніх поколінь.",
  "memorandumSecond": "Дякуємо за ваш інтерес та розгляд нашого запрошення до партнерства. Звертайтеся, і разом ми зробимо значущий внесок у збереження нашої планети.",

  "volunteerings": "волонтерство",
  "volunteers": "Волонтери!",
  "volunteersFirst": "Шукаєте можливість долучитися до команди людей, які прагнуть зробити світ кращим місцем для життя? Громадська Організація «Платформа еко-енергетичних ініціатив» потребує саме вас! ",
  "volunteersSecond": "Ми шукаємо волонтерів, які готові долучитися до наших ініціатив збереження природи, переробки вторинної сировини та впровадження відновлювальних джерел енергії.",
  "volunteersStepFirstBefore": "Ознайомитись з ",
  "volunteersStepFirstLink": "Положенням про волонтерську діяльність у сфері надання безоплатної допомоги Громадської організації «Платформа еко-енергетичних ініціатив»",
  "volunteersStepFourth": "Пройти співбесіду з керівником відділу по роботі з волонтерами",
  "volunteersStepFifthBefore": "Укласти ",
  "volunteersStepFifthLink": "договір",
  "volunteersStepSixth": "Отримати посвідчення волонтера встановленого зразка",
  "treesDescFirst": "Приєднуйся до нас сьогодні та станьте частиною цієї надихаючої спільноти! ",
  "treesDescSecond": "Разом ми зможемо зробити реальний внесок у майбутнє нашої планети.",

  "publishedBy": "Опубліковано",
  "toShare": "Поділитися",
  "readAlso": "Читайте також",

  "our": "Наша",
  "team": "Команда",

  "serhiiHladyshko": "Сергій Гладишко",
  "founderOfTheOrganization": "Голова правління",
  "aboutSerhiiHladyshko": "Має вищу юридичну освіту. Керівник приватного підприємства, приватний підприємець у сфері розробки і впровадження обладнання для переробки вторинної сировини. Частину часу приділяє роботі у громадській сфері, а саме: робота із дітьми і молоддю з ГО \"ПЕЕІ.\"",
  "yevgenyBezkorovainy": "Євгеній Безкоровайний",
  "deputyChairman": "Заступник голови правління",
  "aboutYevgenyBezkorovainy": "Має вищу економічну освіту. Працював у різних галузях економіки. Має значний досвід у стратегічному плануванні та прогнозуванні виробничих процесів. Брав участь у багатьох соціально-економічних молодіжних проектах. Займається волонтерською діяльністью.",

  "ilonaGordienko": "Ілона Гордієнко",
  "memberOfTheBoard": "Членкиня правління",
  "aboutIlonaGordienko": "Має ступень Магістра у сфері облік та аудит, досвід роботи головним бухгалтером 30 років у різних сферах діяльності, вміє працювати з людьми, стресостійка.",

  "tatianaBezkorovaina": "Тетяна Безкоровайна",
  "aboutTatianaBezkorovaina": "Має вищу економічну освіту. Досвідчений спеціаліст з великим досвідом у розвитку міжнародних зв'язків та академічної мобільності. Проводить консультативну та організаційну підтримку науково-педагогічним працівникам, дослідникам та студентам у плануванні та розвитку міжнародного співробітництва.",

  "mykolaGordienko": "Микола Гордієнко",
  "projectManager": "Керівник проєкту",
  "aboutMykolaGordienko": "Має не повну вищу юридичну освіту, вміє працювати у команді, має досвід по роботі з клієнтами, брав участь у фандрейзинговому проекті, займається волонтерством.",

  "officialDocuments": "Офіційні документи",
  "extract": "Виписка",
  "charter": "Статут",
  "volunteerRegulations": "Положення ГО ПЕЕІ про залучення волонтерів 2023",
  "offerAgreement": "Договір оферти",
  "lawsOfUkraineRelatedToVolunteering": "ЗАКОНИ УКРАЇНИ ПОВ’ЯЗАНІ З ВОЛОНТЕРСТВОМ",
  "volunteeringLaw": "Закон України “Про волонтерську діяльність”",
  "charitableActivitiesLaw": "Закон України “Про благодійну діяльність та благодійні організації”",

  "safetyRulesDuringMartialLaw": "Правила безпеки під час воєнного стану",
  "notFound": "Щось пішло не так!",
  "notFoundBtn": "На головну",

  "ourPartners": "Наші партнери",
  "becomeAPartner": "Cтати партнером",
  "fop": "ФОП",

  "teamDev": "Команда",
  "devTeam": "Розробки",

  "lidiaTarovita": "Лідія Таровита",

  "designer": "UI/UX дизайнер",
  "qa": "QA Інженер-тестувальник",
  "developer": "Розробник"
}
