// import Image from "next/image";
// import about1 from "../../../public/about/aboutus1image.jpg";

// const AboutUs = (aboutText, imageSrc) => {
//   return (
//     <div className="container">
//       {/* <h1
//         style={{
//           margin: "20px 0px",
//           display: "flex",
//           justifyContent: "center",
//         }}
//       >
//         Ласкаво просимо до Громадської Організації &quot;Платформа
//         еко-енергетичних ініціатив&quot;!
//       </h1> */}
//       <section>
//         <p className="about__text">
//           У світлі сучасних екологічних викликів та змін клімату, наша
//           організація стає важливим гравцем у формуванні стійкого та екологічно
//           безпечного майбутнього. Ми вітаємо вас у спільноті, де експерти та
//           активісти об&lsquo;єднують свої зусилля для впровадження ідей
//           збереження довкілля, переробки вторсировини та розвитку
//           відновлювальної енергетики. Ми визнаємо кризу пластикового забруднення
//           та активно впроваджуємо програми переробки вторсировини, зокрема
//           пластику. За допомогою інноваційних технологій та співпраці з
//           експертами у сфері відновлення ресурсів, ми долучаємо свої зусилля до
//           зменшення негативного впливу пластику на наше середовище. Наша
//           організація активно працює над вдосконаленням технологій переробки
//           пластику, розробляє та впроваджує програми вторсировини, щоб зменшити
//           кількість відходів та сприяти ефективному використанню ресурсів.
//           Пластикові відходи стають вихідним матеріалом для нових, сталих
//           виробів, допомагаючи зберегти наше довкілля.
//         </p>
//       </section>
//       <section style={{ display: "flex" }}>
//         <Image className="about__images" src={about1} alt={"about us image"} />
//         <div className="about__text-block">
//           <h3 className="about__text-block-title">Наші цінності</h3>
//           <ul>
//             <li className="about__text-block-item">
//               <p>
//                 Відкритість: Чесність і прозорість роблять нашу організацію
//                 більшою та ефективнішою.
//               </p>
//             </li>
//             <li className="about__text-block-item">
//               <p>
//                 Співпраця: У нас вірять в силу колективної дії – разом ми
//                 змінюємо світ.
//               </p>
//             </li>
//             <li className="about__text-block-item">
//               <p>
//                 Довіра: Взаємна підтримка та віра в смілі дії є основою нашого
//                 спільного шляху.
//               </p>
//             </li>
//             <li className="about__text-block-item">
//               <p>
//                 Терміновість: У світі швидких змін ми працюємо чуйно та
//                 ефективно.
//               </p>
//             </li>
//           </ul>
//         </div>
//       </section>
//     </div>
//   );
// };

// export default AboutUs;
