import React from "react";
import s from "./docs.module.scss";
import style from "../../../styles/utils/Container.module.scss";
import sign from "../../../../../public/docs/sign.png";
import Image from "next/image";

const DogovirOfferPage = () => {
  console.log(sign);

  return (
    <div className={`${style.container} ${s.container__offertContract}`}>
      <h1 className={s.offertContract__title}>
        Договір Публічної Оферти про надання благодійного внеску
      </h1>
      <p className={s.offertContract__paragraf}>
        Ця публічна оферта про надання пожертвувань у благодійних цілях (надалі
        – Оферта) спрямована на невизначене коло фізичних осіб (надалі –
        Благодійник), які є відвідувачами офіційного сайту Громадської
        організації «Платформа еко-енергетичних ініціатив» (надалі –
        «Організація»), у мережі інтернет за посиланням{" "}
        <a href="https://peei.org.ua/">https://peei.org.ua/</a>
        (надалі – «Сайт») та бажають здійснити благодійну пожертву у розумінні
        даної публічної оферти (надалі – Договір благодійної пожертви), разом за
        текстом Оферти іменуються «Сторони», а кожен окремо – «Сторона». Текст
        Оферти є офіційною пропозицією Громадської організації «Платформа
        еко-енергетичних ініціатив», в особі Голови правління Гладишко Сергія
        Олексійовича, який діє на підставі Статуту, укласти договір про
        благодійний внесок (надалі – «Договір»), суть якого викладена нижче.
      </p>
      <h3 className={s.offertContract__title__h3}>1. Визначення та поняття</h3>
      <p className={s.offertContract__paragraf}>
        1.1. Публічна оферта – чинна пропозиція Організації, розміщена на Сайті,
        про надання благодійного внеску, адресована до необмеженого кола осіб, у
        тому числі Благодійника. <br />
        1.2. Акцепт – повне і безумовне прийняття Публічної оферти шляхом
        вчинення дій щодо здійснення грошового переказу за допомогою платіжних
        форм та засобів, розміщених на Сайті, а також шляхом перерахування
        грошових коштів на розрахунковий рахунок Організації через установи
        банків. Моментом Акцепту є дата зарахування коштів на банківський
        розрахунковий рахунок Організації.
        <br /> 1.3. Благодійна пожертва – безоплатна передача Благодійником
        засобів у власність Організації для досягнення певних, заздалегідь
        обумовлених цілей діяльності, відповідно до Договору та Закону України
        «Про благодійну діяльність та благодійні організації».
      </p>
      <h3 className={s.offertContract__title__h3}> 2. Предмет договору</h3>
      <p className={s.offertContract__paragraf}>
        2.1. Предметом цього договору є безоплатна і добровільна передача від
        Благодійника до Організації грошових коштів, шляхом здійснення
        добровільних пожертвувань для реалізації статутних цілей та діяльності
        Організації, а також щодо надання Організацією благодійної допомоги
        відповідно до Закону України «Про благодійну діяльність та благодійні
        організації», програм Організації.
        <br /> 2.2. Обсяг та розмір благодійних пожертвувань Благодійник
        визначає самостійно на власний розсуд.
        <br /> 2.3. Виконання сторонами умов Оферти не має на меті отримання
        прибутку або будь-яких благ для жодної із сторін.
        <br /> 2.4. Сторони підтверджують, що отримання прибутку (прямо чи
        опосередковано) Сторонами не є предметом Оферти.
        <br /> 2.5. Прийняття Благодійником цієї Публічної оферти здійснюється
        шляхом сплати Благодійної пожертви.
      </p>
      <h3 className={s.offertContract__title__h3}> 3. Акцепт Оферти</h3>
      <p className={s.offertContract__paragraf}>
        3.1. Акцепт Оферти (прийняття умов Оферти) означає, що Благодійник
        згоден з усіма його положеннями, він ознайомлений зі Статутом
        Організації, який розміщений в електронному вигляді на Сайті
        Організації, він повною мірою усвідомлює і згоден з предметом Договору,
        з метою та цілями публічного збору благодійних пожертв і з правом
        Організації використовувати частину Благодійної пожертви Благодійника на
        адміністративні витрати Організації, в розмірі не більшому, ніж це
        передбачено законодавством України.
        <br /> 3.2. Благодійник і Організація, керуючись ст. 207, ч. 2 ст. 639,
        ст. 641, 642 Цивільного кодексу України, погоджуються, що з моменту
        Акцепту Оферти Договір благодійної пожертви вважається укладеним.
        <br /> 3.3. Сторони погоджуються, що недодержання Сторонами письмової
        форми Договору благодійної пожертви, не означає його недійсність.
      </p>
      <h3 className={s.offertContract__title__h3}>
        {" "}
        4. Права та обов’язки Організації
      </h3>
      <p className={s.offertContract__paragraf}>
        4.1. Організація має право: <br />
        4.1.1. Отримувати Благодійні пожертви і використовувати їх відповідно до
        умов Оферти та Договору благодійної пожертви. <br />
        4.1.2. Змінювати напрямки використання благодійної пожертви в межах
        Статутної діяльності Організації. <br />
        4.1.3. Використовувати частину Благодійного пожертви на адміністративні
        витрати Організації, без погодження з Благодійником, у розмірі не
        більшому, ніж це передбачено законодавством України. <br />
        4.2. Організація зобов’язана:
        <br /> 4.2.1. Створити умови необхідні Благодійнику для внесення
        Благодійної пожертви згідно умов Оферти.
        <br />
        4.2.2. Використовувати отримані благодійні пожертви для досягнення
        цілей, передбачених Статутом Організації.
        <br /> 4.2.3. Зберігати конфіденційну інформацію (в т.ч. персональні
        дані), отриману від Благодійника, не передавати її третім особам без
        згоди Благодійника, за винятком випадків, встановлених Офертою і чинним
        законодавством України.
      </p>
      <h3 className={s.offertContract__title__h3}>
        {" "}
        5. Права та обов’язки Благодійника
      </h3>
      <p className={s.offertContract__paragraf}>
        5.1. Благодійник має право: <br />
        5.1.1. Перерахувати добровільну благодійну пожертву на рахунок
        Організації у спосіб зазначений у Договорі. <br />
        5.1.2. Звернутися до Організації з метою отримання звіту щодо
        використання Організацією благодійних пожертвувань <br />
        5.2. Благодійник зобов’язаний: <br />
        5.2.1. Детально та уважно ознайомитися з усіма правилами та умовами
        Оферти й прийняти їх при здійсненні оплати благодійної пожертви, а також
        всіма додатковими правилами, що регулюють відносини Сторін відповідно до
        Оферти.
      </p>
      <h3 className={s.offertContract__title__h3}>
        6. Місце та строки отримання благодійних пожертв
      </h3>
      <p className={s.offertContract__paragraf}>
        6.1. Публічний збір пожертв проводиться на території будь-якої з країн
        світу у порядку, передбаченому ст. 7 Закону України «Про благодійну
        діяльність та благодійні організації». Безпосередня діяльність
        Організації, що стосується публічного збору пожертв за Договором,
        проводиться за місцезнаходженням Організації. 6.2. Публічний збір
        пожертвувань триває до моменту ліквідації Організації, якщо інший термін
        не буде визначений Організацією.
      </p>
      <h3 className={s.offertContract__title__h3}>
        {" "}
        7. Порядок здійснення благодійної пожертви.
      </h3>
      <p className={s.offertContract__paragraf}>
        7.1. Організація забезпечує Благодійнику можливість сплати Благодійної
        пожертви електронним платежем на Сайті, шляхом переказу грошових коштів
        на банківський рахунок Організації:
      </p>
      <h4 className={s.offertContract__title__h4}>
        Реквізити для здійснення благодійних пожертв в межах України у гривні:
      </h4>
      <p className={s.offertContract__paragraf}>
        Громадська Організація «Платформа Еко-Енергетичних Ініціатив» Код ЄДРПОУ
        45068741
      </p>
      <p className={s.offertContract__paragraf}>
        IBAN <span>UA893348510000000026002234362</span>
      </p>
      <p className={s.offertContract__paragraf}>
        В АТ «ПУМБ» в м. Бровари МФО 334851
      </p>
      <ul>
        <li>• Призначення платежу : Благодійна пожертва.</li>
      </ul>
      <h4 className={s.offertContract__title__h4}>
        Реквізити для здійснення благодійних пожертв в межах України у гривні:
      </h4>
      <ul>
        <li>• Із США:</li>
      </ul>
      <p className={s.offertContract__paragraf}>
        Реквізити рахунків клієнта в АТ «ПУМБ» Клієнт : Громадська Організація
        «Платформа Еко-Енергетичних Ініціатив» Ідент. Код: 45068741 В доларах
        США (USD)
      </p>
      <table className={s.offertContract__table}>
        <thead></thead>
        <tbody>
          <tr>
            <td>
              Intermediary
              <br />
              Банк-посередник
            </td>
            <td>
              The Bank of New York Mellon <br />
              SWIFT: IRVTUS3N
              <br /> оr/або <br />
              JPMorgan Chase Bank N.A.* <br />
              SWIFT: CHASUS33
            </td>
          </tr>
          <tr>
            <td>
              Beneficiary’s bank
              <br />
              Банк одержувача
              <br />
              Beneficiary’s bank
              <br />
              Банк одержувача
            </td>
            <td>
              FIRST UKRAINIAN INTERNATIONAL BANK <br />
              SWIFT BIC: FUIBUA2X
            </td>
          </tr>
          <tr>
            <td>
              Beneficiary
              <br />
              Одержувач
              <br />
              Name
              <br />
              IBAN
            </td>
            <td>
              Hromadsʹka orhanizatsiya <br />
              «Platforma Eko-Enerhetychnykh Initsiatyv»
              <br />
              UA893348510000000026002234362
            </td>
          </tr>
          <tr>
            <td>
              Address of the beneficiary is the recipient
              <br />
              Адреса бенефіціара – отримувача
            </td>
            <td>
              23B, 170, Symona Petlyury str., сity Brovary, 07406, Kyiv region,
              Ukraine.
            </td>
          </tr>
          <tr>
            <td>
              Address of the recipient’s bank
              <br />
              Адреса банку – одержувача
            </td>
            <td>4, Andriivska str., Kyiv, 04070, Ukraine</td>
          </tr>
        </tbody>
      </table>
      <p>
        Please note that when transferring money, it must be marked as:
        <span>Charitable donation for the Public Organization "PEEI"</span>
      </p>
      <p>
        Реквізити рахунків клієнта в АТ «ПУМБ»
        <br /> Клієнт : Громадська Організація «Платформа Еко-Енергетичних
        Ініціатив»
        <br /> Ідент. Код: 45068741 <br />В Євро (EUR)
      </p>
      <table className={s.offertContract__table}>
        <thead></thead>
        <tbody>
          <tr>
            <td>
              Intermediary
              <br />
              Банк-посередник
            </td>
            <td>
              Commerzbank AG, Frankfurt am Main, Germany <br />
              SWIFT: COBADEFF
              <br /> оr/або <br />
              Landesbank Baden-Wurttemberg, Germany, D-70173. Stuttgart <br />
              SWIFT: SOLADEST
            </td>
          </tr>
          <tr>
            <td>
              Beneficiary’s bank
              <br />
              Банк одержувача
              <br />
              Beneficiary’s bank
              <br />
              Банк одержувача
            </td>
            <td>
              FIRST UKRAINIAN INTERNATIONAL BANK <br />
              SWIFT BIC: FUIBUA2X
            </td>
          </tr>
          <tr>
            <td>
              Beneficiary
              <br />
              Одержувач
              <br />
              Name
              <br />
              IBAN
            </td>
            <td>
              Hromadsʹka orhanizatsiya <br />
              «Platforma Eko-Enerhetychnykh Initsiatyv»
              <br />
              UA893348510000000026002234362
            </td>
          </tr>
          <tr>
            <td>
              Address of the beneficiary is the recipient
              <br />
              Адреса бенефіціара – отримувача
            </td>
            <td>
              23B, 170, Symona Petlyury str., сity Brovary, 07406, Kyiv region,
              Ukraine.
            </td>
          </tr>
          <tr>
            <td>
              Address of the recipient’s bank
              <br />
              Адреса банку – одержувача
            </td>
            <td>4, Andriivska str., Kyiv, 04070, Ukraine</td>
          </tr>
        </tbody>
      </table>
      <p>
        Please note that when transferring money, it must be marked as:
        <span>Charitable donation for the Public Organization "PEEI"</span>
      </p>
      <p className={s.offertContract__paragraf}>
        Благодійник на власний вибір обирає формат платежу: одноразовий або
        регулярний (з можливістю скасувати регулярні платежі в будь-який час).
        <br />
        7.2. Платіж визнається вчиненим Благодійником у момент підтвердження
        успішної транзакції з боку банку або платіжної системи. Всі витрати по
        сплаті сум, пов’язаних з перерахуванням пожертвування, несе Благодійник.
        <br />
        7.3. Благодійна пожертва, сплачена Благодійником, не підлягає поверненню
        за жодних обставин.
      </p>
      <h3 className={s.offertContract__title__h3}>
        8. Порядок використання благодійних пожертвувань:
      </h3>
      <p className={s.offertContract__paragraf}>
        8.1. Використання зібраних за Договором Благодійних пожертв проводиться
        у відповідності з цілями статутної діяльності Організації. Організація
        розпоряджається Благодійними пожертвами на власний розсуд. Отримані
        Організацією Благодійні пожертви не повертаються. Відповідальність
        сторін за порушення умов цього Договору або порядку використання
        Благодійних пожертв передбачено вимогами чинного законодавства України.
        8.2. Благодійник або уповноважені ним особи мають право здійснювати
        контроль за цільовим використанням Благодійної пожертви.
      </p>
      <h3 className={s.offertContract__title__h3}>
        9. Відповідальність Сторін
      </h3>
      <p className={s.offertContract__paragraf}>
        9.1. У разі невиконання або неналежного виконання своїх зобов’язань,
        передбачених Офертою, Сторони несуть відповідальність відповідно до
        чинного законодавства України та умов цієї Оферти. 9.2. Організація не
        несе відповідальності в разі вчинення дії/бездіяльності третіх осіб,
        внаслідок яких Організації не змогла виконати свої зобов’язання за
        Офертою.
      </p>
      <h3 className={s.offertContract__title__h3}>
        10. Конфіденційність та захист персональних даних
      </h3>
      <p className={s.offertContract__paragraf}>
        10.1. Благодійник, шляхом здійснення Акцепту підтверджує, що він
        ознайомлений і дає згоду щодо збору та обробки персональних даних. 10.2.
        Організація здійснює збір і обробку персональних даних Благодійника в
        цілях виконання своїх зобов’язань відповідно до Оферти та відповідно до
        Закону України «Про захист персональних даних». 10.3. Благодійник згоден
        з тим, що після внесення інформації про себе під час здійснення
        Благодійної пожертви, підписки на новини Організації на Сайті, йому
        можуть направлятися звіти про результати публічних зборів та
        використання благодійних пожертв Організацією, листи та повідомлення, у
        тому числі рекламного характеру. 10.4. Організація зобов’язується не
        передавати електронну адресу та іншу інформацію про благодійників третім
        особам за виключенням випадків передбачених діючим законодавством
        України. 10.5. Організація не несе відповідальності за розголошення
        персональних даних, що відбулися внаслідок незаконних дій третіх осіб
        або у випадку якщо таке розголошення відбулося за згодою Благодійника.
      </p>
      <h3 className={s.offertContract__title__h3}>
        11. Строк дії Оферти. Порядок внесення змін та доповнень
      </h3>
      <p className={s.offertContract__paragraf}>
        11.1. Публічна оферта набуває чинності з моменту її розміщення на Сайті
        і діє до моменту ліквідації Організації, якщо інший термін не буде
        визначений Організацією. Положення цього пункту поширюються і на
        доповнення (зміни) до Оферти. 11.2. Організація має право змінювати
        умови Публічної оферти без згоди Благодійника. Організація залишає за
        собою право в односторонньому порядку змінити умови Оферти в будь-який
        час, без будь-яких обмежень, шляхом опублікування нової редакції Оферти
        на Сайті. 11.3. Благодійник зобов’язаний самостійно відстежувати зміни
        умов Оферти шляхом ознайомлення з чинною новою (актуальною) редакцією на
        Сайті.
      </p>
      <h3 className={s.offertContract__title__h3}>
        12. Порядок вирішення спорів
      </h3>
      <p className={s.offertContract__paragraf}>
        12.1. Спори та суперечки, що виникають при виконанні Договору
        благодійної пожертви укладеного на умовах Оферти, вирішуються шляхом
        переговорів у письмовому вигляді. 12.2. Претензія подається Стороні в
        письмовому вигляді шляхом направлення рекомендованого листа із
        повідомленням про вручення, у строк не більше 10 (десяти) календарних
        днів з дати виникнення зауважень, що є підставою для спору чи суперечки.
        Претензія розглядається протягом 10 (десяти) календарних днів, що
        обчислюються з дня вручення її Стороні, якій її адресовано. 12.3. У
        випадку неможливості Сторін досягти згоди під час переговорів у
        письмовій формі, спір що виник підлягає розгляду в порядку,
        передбаченому чинним законодавством України. 12.4. З усіх інших питань,
        не передбачених цією Офертою, Сторони керуються чинним законодавством
        України
      </p>
      <h3 className={s.offertContract__title__h3}>13. Форс-мажор</h3>
      <p className={s.offertContract__paragraf}>
        13.1. Сторони звільняються від відповідальності за невиконання або
        неналежне виконання обов’язків за умовами Оферти, якщо вказане
        невиконання є наслідком дії обставин непереборної сили та їх наслідків,
        а саме: пожеж, епідемій, повенів, землетрусів чи інших стихійних лих,
        війни і військових дій, страйку (-ів), диверсії, аварії, масового
        безладдя і заворушень, карантинних обмежень, актів органів державної
        влади або управління, міжнародних санкцій і т.д., які безпосередньо
        впливають на виконання Договору і виникли після його укладення. При
        цьому строк виконання зобов’язань за таким Договором продовжується на
        час дії вказаних обставин та їх наслідків. 13.2. Сторона, яка не в змозі
        виконати свої зобов’язання за Договором у результаті дії обставин
        форс-мажору та їх наслідків, зобов’язана протягом 15-ти днів письмово
        повідомити іншу Сторону про початок або закінчення дії цих обставин, а
        також надати документальне підтвердження їх виникнення та наявності.
        13.3. Неповідомлення або несвоєчасне повідомлення про обставини
        форс-мажору позбавляє відповідну Сторону права посилатися на вказані
        обставини, як на такі, що звільняють від відповідальності. Повідомлення
        Фонду про настання форс-мажорних обставин можливе, поміж інших, шляхом
        розміщення відповідної інформації на Сайті. 13.4. Підтвердженням
        наявності та тривалості форс-мажорних обставин є довідки, видані
        уповноваженими органами державної влади України.
      </p>
      <p>
        Організація:
        <br /> Громадська організація «Платформа еко-енергетичних ініціатив»
        <br /> 07400. Україна.
        <br /> Київсбка обл. м. Бровари,
        <br /> вул. Симона Петлюри 23Б, 170 <br />
        ЕДРПOУ 45068741
        <br />
        банківські реквізити: <br />
        IBAN UA523003460000026002000005025 <br />в АТ «Сенс банк», МФО 300346{" "}
        <br /> Email: copeeiua@gmail.com <br />
      </p>
      <div className={s.offertContract__signThumb}>
        Голова правління _____________________ Гладишко С.О.
        <div className={s.offertContract__sign}>
          <Image width={70} src={sign} alt="sign" />
        </div>
      </div>
    </div>
  );
};

export default DogovirOfferPage;
